load-test-server.yml
config:
  target: 'http://api.wasally.me'
  capture:
    - request
    - response
  phases:
    - duration: 1
      arrivalRate: 12
      name: 'testing'
  payload:
    path: ./data.csv
    cast: false
    order: random
    loadAll: true
    skipHeader: true
    delimiter: ','
    skipEmptyLines: true
    fields:
      - 'email'
      - 'name'
      - 'password'
      - 'confirmpassword'
      - 'phoneNumber'
      - 'emailLogin'
      - 'passwordLogin'
      - 'NationalId'
      - 'to'
      - 'from'
      - 'item'
      - 'weight'
      - 'location'
      - 'targetLocation'
      - 'category'
      - 'buyOrdeliver'
      - 'price'
      - 'date'
      - 'toupdate'
scenarios:
  - name: 'Register Flow'
    flow:
      - post:
          url: '/v1/auth/register'
          json:
            email: '{{ email }}'
            name: '{{ name }}'
            password: '{{ password }}'
            confirmpassword: '{{ confirmpassword }}'
            phoneNumber: '{{ phoneNumber }}'

      # - post:
      #     url: '/v1/auth/login'
      #     json:
      #       email: '{{ emailLogin }}'
      #       password: '{{ passwordLogin }}'
      #     capture:
      #       json: '$.token'
      #       as: 'token'
      #       name: 'Login request'
      # - log: 'Login request: {{ token }}'

      # - post:
      #     headers:
      #       Authorization: 'Bearer {{ token }}'
      #     url: '/v1/requests/'
      #     json:
      #       to: '{{ to }}'
      #       from: '{{ from }}'
      #       item: '{{ item }}'
      #       weight: '{{ weight }}'
      #       location: '{{ location }}'
      #       targetLocation: '{{ targetLocation }}'
      #       category: '{{ category }}'
      #       buyOrdeliver: '{{ buyOrdeliver }}'
      #       price: '{{ price }}'
      #       date: '{{ date }}'
      #     capture:
      #       json: '$.request.id'
      #       as: 'id'
      #       name: 'Create Request'

      # - patch:
      #     headers:
      #       Authorization: 'Bearer {{ token }}'
      #     url: '/v1/requests/{{ id }}'
      #     json:
      #       to: '{{ toupdate }}'
      #     capture:
      #       json: '$.message'
      #       as: 'update_message'
      #     name: 'Update Request'
      # - log: 'Update Request: {{ update_message }}'

      # - delete:
      #     headers:
      #       Authorization: 'Bearer {{ token }}'
      #     url: '/v1/requests/{{ id }}'
      #     capture:
      #       json: '$.message'
      #       as: 'delete_message'
      #     name: 'Delete Request'
      # - log: 'Delete Request: {{ delete_message }}'